000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.	SUBPROGRAM.
000030 AUTHOR.	JACOB M PECK.
000040*Hello world with a subprogram
000050
000060 ENVIRONMENT DIVISION.
000070
000080 DATA DIVISION.
000090
000100 PROCEDURE DIVISION.
000110 MAIN-PARAGRAPH.
000120	      CALL 'HELLO-SUB'
000130        STOP RUN.
000140
000150
000160 IDENTIFICATION DIVISION.
000170 PROGRAM-ID.	HELLO-SUB.
000180 AUTHOR.	JACOB M PECK.
000190*Subprogram that prints hello world
000200
000210 ENVIRONMENT DIVISION.
000220
000230 DATA DIVISION.
000240 WORKING-STORAGE SECTION.
000250 01 TEXT-OUT  PIC X(12) VALUE 'Hello World!'.
000260
000270 PROCEDURE DIVISION.
000280 MAIN-PARAGRAPH.
000290        DISPLAY TEXT-OUT
000300        EXIT PROGRAM.
000310 END PROGRAM HELLO-SUB.
000320 END PROGRAM SUBPROGRAM.
